PerformanceTesting/pa_sqldw_load_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">C:\Users\a30001789\atul\myWorkspace\db_load_test\library\azure-jdbc-driver-0.0.1-all.jar,C:\Users\a30001789\atul\myWorkspace\db_load_test\library\sqljdbc_7_2\enu\mssql-jdbc-7.2.2.jre8.jar</stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="JDBCUsers" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="DBConfig" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">Select 1</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="dbUrl">jdbc:sqlserver://edptstsqldw00.database.windows.net:1433;database=edptstdb;encrypt=true;trustServerCertificate=false;hostNameInCertificate=*.database.windows.net;loginTimeout=30;authentication=ActiveDirectoryPassword</stringProp>
          <stringProp name="driver">com.microsoft.sqlserver.jdbc.SQLServerDriver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="poolMax">10</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">a30001789@agl.com.au</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_BusinessPartner" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [customer].[dim_BusinessPartner]
</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_Contract" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_Contract];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_ContractItem" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_ContractItem];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_ContractAccount" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [customer].[dim_ContractAccount];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_BusinessPartnerMarketingAttributes" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_BusinessPartnerMarketingAttributes];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_BusinessPartnerContact" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [customer].[dim_BusinessPartnerContact];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_Premise" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_Premise];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_Installation" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_Installation];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_Installation_s" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [customer_health].[dim_Installation_s];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_InstallationHistory" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [dv_commercial].[dim_InstallationHistory];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_InstallationRegisterRate" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_InstallationRegisterRate];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_Device" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_Device];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_InstallationPointOfDelivery" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_InstallationPointOfDelivery];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_Pricekey_cr" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_Pricekey_cr];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_ContractItemRateRelationship_cr" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_ContractItemRateRelationship_cr];
</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_RatePriceRelationship_cr" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) from [commercial].[dim_RatePriceRelationship_cr];</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_MyAccount" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[dim_MyAccount]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_ValueAddedService_cr" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [customer].[dim_ValueAddedService_cr]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_ConcessionCard" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [customer].[dim_ConcessionCard]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test fact_SentInvoice" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[fact_SentInvoice]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_Invoice" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[dim_Invoice]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_ContractDiscountHistory_cr" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[dim_ContractDiscountHistory_cr]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test fact_ContractDebt" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[fact_ContractDebt]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test fact_ContractPayment" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[fact_ContractPayment]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_PaymentDocument" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[dim_PaymentDocument]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_HardshipCustomer" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [customer].[dim_HardshipCustomer]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test fact_ContractDunning" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[fact_ContractDunning]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_BillSmoothing_cr" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[dim_BillSmoothing_cr]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test dim_PromiseToPay_cr" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[dim_PromiseToPay_cr]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test fact_PromiseToPay" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[fact_PromiseToPay]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test fact_BillSmoothing" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[fact_BillSmoothing]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Test fact_ContractOtherCharges" enabled="true">
          <stringProp name="dataSource">testdb_con</stringProp>
          <stringProp name="query">select count(*) FROM [commercial].[fact_ContractOtherCharges]</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Count Records</stringProp>
        </JDBCSampler>
        <hashTree>
          <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">C:\Users\a30001789\atul\myWorkspace\db_load_test\logs\tree_logs.csv</stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">C:\Users\a30001789\atul\myWorkspace\db_load_test\logs\summary_logs.csv</stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>